IRP/src/Documents/SalesReportToConsignor/SalesReportToConsignor.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>SalesReportToConsignor</name>
  <registerRecords>InformationRegister.T2015S_TransactionsInfo</registerRecords>
  <registerRecords>AccumulationRegister.R1021B_VendorsTransactions</registerRecords>
  <registerRecords>AccumulationRegister.R5010B_ReconciliationStatement</registerRecords>
  <registerRecords>AccumulationRegister.R1020B_AdvancesToVendors</registerRecords>
  <registerRecords>AccumulationRegister.R1040B_TaxesOutgoing</registerRecords>
  <registerRecords>InformationRegister.PostedDocumentsRegistry</registerRecords>
  <registerRecords>AccumulationRegister.R5020B_PartnersBalance</registerRecords>
  <registerRecords>AccumulationRegister.T1040T_AccountingAmounts</registerRecords>
  <attributes>
    <name>Agreement</name>
    <type>
      <types>CatalogRef.Agreements</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>LegalName</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Partner</name>
    <type>
      <types>CatalogRef.Partners</types>
    </type>
  </attributes>
  <attributes>
    <name>PriceIncludeTax</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>LegalNameContract</name>
    <type>
      <types>CatalogRef.LegalNameContracts</types>
    </type>
  </attributes>
  <attributes>
    <name>StartDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>EndDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TradeAgentFeeType</name>
    <type>
      <types>EnumRef.TradeAgentFeeTypes</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ItemList</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>DefinedType.typeRowID</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>ItemKey</name>
      <type>
        <types>CatalogRef.ItemKeys</types>
      </type>
    </attributes>
    <attributes>
      <name>Unit</name>
      <type>
        <types>CatalogRef.Units</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.typeQuantity</types>
      </type>
    </attributes>
    <attributes>
      <name>ConsignorPrice</name>
      <type>
        <types>DefinedType.typePrice</types>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>DefinedType.typePrice</types>
      </type>
    </attributes>
    <attributes>
      <name>PriceType</name>
      <type>
        <types>CatalogRef.PriceTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>TaxAmount</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
    <attributes>
      <name>TotalAmount</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
    <attributes>
      <name>NetAmount</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
    <attributes>
      <name>DontCalculateRow</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityInBaseUnit</name>
      <type>
        <types>DefinedType.typeQuantity</types>
      </type>
    </attributes>
    <attributes>
      <name>UseSerialLotNumber</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>IsService</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>PurchaseInvoice</name>
      <type>
        <types>DocumentRef.PurchaseInvoice</types>
        <types>DocumentRef.OpeningEntry</types>
      </type>
    </attributes>
    <attributes>
      <name>SalesInvoice</name>
      <type>
        <types>DocumentRef.RetailSalesReceipt</types>
        <types>DocumentRef.SalesInvoice</types>
      </type>
    </attributes>
    <attributes>
      <name>TradeAgentFeePercent</name>
      <type>
        <types>DefinedType.typePercent</types>
      </type>
    </attributes>
    <attributes>
      <name>TradeAgentFeeAmount</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityIsFixed</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>VatRate</name>
      <type>
        <types>CatalogRef.TaxRates</types>
      </type>
    </attributes>
    <attributes>
      <name>Project</name>
      <type>
        <types>CatalogRef.Projects</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>DELETE_TaxList</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>DefinedType.typeRowID</types>
      </type>
    </attributes>
    <attributes>
      <name>Tax</name>
      <type>
        <types>CatalogRef.Taxes</types>
      </type>
    </attributes>
    <attributes>
      <name>Analytics</name>
      <type>
        <types>CatalogRef.TaxAnalytics</types>
      </type>
    </attributes>
    <attributes>
      <name>TaxRate</name>
      <type>
        <types>CatalogRef.TaxRates</types>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
    <attributes>
      <name>IncludeToTotalAmount</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ManualAmount</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Currencies</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>DefinedType.typeRowID</types>
      </type>
    </attributes>
    <attributes>
      <name>CurrencyFrom</name>
      <type>
        <types>CatalogRef.Currencies</types>
      </type>
    </attributes>
    <attributes>
      <name>Rate</name>
      <type>
        <types>DefinedType.typeCurrencyRate</types>
      </type>
    </attributes>
    <attributes>
      <name>ReverseRate</name>
      <type>
        <types>DefinedType.typeCurrencyRate</types>
      </type>
    </attributes>
    <attributes>
      <name>ShowReverseRate</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Multiplicity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>MovementType</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
    <attributes>
      <name>IsFixed</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AddAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AddAttributeAndProperty</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>SerialLotNumbers</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>DefinedType.typeRowID</types>
      </type>
    </attributes>
    <attributes>
      <name>SerialLotNumber</name>
      <type>
        <types>CatalogRef.SerialLotNumbers</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.typeQuantity</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>SourceOfOrigins</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>DefinedType.typeRowID</types>
      </type>
    </attributes>
    <attributes>
      <name>SerialLotNumber</name>
      <type>
        <types>CatalogRef.SerialLotNumbers</types>
      </type>
    </attributes>
    <attributes>
      <name>SourceOfOrigin</name>
      <type>
        <types>CatalogRef.SourceOfOrigins</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.typeQuantity</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

IRP/src/Documents/SalesReportToConsignor/Forms/FillSales/Module.bsl
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	ThisObject.SalesPeriod.StartDate = Parameters.StartDate;
	ThisObject.SalesPeriod.EndDate   = Parameters.EndDate;	
	
	ThisObject.Company   = Parameters.Company;	
	ThisObject.Partner   = Parameters.Partner;	
	ThisObject.Agreement = Parameters.Agreement;
	ThisObject.PriceIncludeTax = Parameters.PriceIncludeTax;
EndProcedure

&AtClient
Procedure OnOpen(Cancel)
	ThisObject.OwnerUUID = FormOwner.UUID;
EndProcedure

&AtClient
Procedure Cancel(Command)
	Close(Undefined);
EndProcedure

&AtClient
Procedure Ok(Command)
	SalesInfo = PutSalesToTempStorage();
	Result = New Structure();
	Result.Insert("StartDate", ThisObject.SalesPeriod.StartDate);
	Result.Insert("EndDate"  , ThisObject.SalesPeriod.EndDate);
	Result.Insert("Address"     , SalesInfo.Address);
	Result.Insert("GroupColumn" , SalesInfo.GroupColumn);
	Result.Insert("SumColumn"   , SalesInfo.SumColumn);
	Close(Result);
EndProcedure

&AtServer
Function PutSalesToTempStorage()
	SalesTable = ThisObject.Sales.Unload().Copy(New Structure("Use", True));	
	Address = PutToTempStorage(SalesTable, ThisObject.OwnerUUID);
	GroupColumn = "Item, ItemKey, Unit, PriceType, ConsignorPrice, TradeAgentFeePercent, Price, Quantity, NetAmount, TotalAmount, SalesInvoice, PurchaseInvoice, SerialLotNumber";
	SumColumn = "SumColumn";
	Return New Structure("Address, GroupColumn, SumColumn", Address, GroupColumn, SumColumn);
EndFunction

&AtClient
Procedure FillSales(Command)
	If Not ThisObject.CheckFilling() Then
		Return;
	EndIf;
	
	FillSalesAtServer();		
EndProcedure

&AtServer
Procedure FillSalesAtServer()
	QueryParameters = New Structure();
	QueryParameters.Insert("StartDate"       , ThisObject.SalesPeriod.StartDate);
	QueryParameters.Insert("EndDate"         , ThisObject.SalesPeriod.EndDate);
	QueryParameters.Insert("Company"         , ThisObject.Company);
	QueryParameters.Insert("Partner"         , ThisObject.Partner);
	QueryParameters.Insert("Agreement"       , ThisObject.Agreement);
	QueryParameters.Insert("PriceIncludeTax" , ThisObject.PriceIncludeTax);
	
	SalesTable = DocSalesReportToConsignorServer.GetConsignorSales(QueryParameters);
	ThisObject.Sales.Load(SalesTable);
EndProcedure

&AtServer
Procedure FillCheckProcessingAtServer(Cancel, CheckedAttributes)
	CheckedAttributes.Add("SalesPeriod");
EndProcedure

&AtClient
Procedure SalesBeforeAddRow(Item, Cancel, Clone, Parent, IsFolder, Parameter)
	Cancel = True;
EndProcedure

&AtClient
Procedure SalesBeforeDeleteRow(Item, Cancel)
	Cancel = True;
EndProcedure

&AtClient
Procedure CheckAll(Command)
	ChangeUse(True);
EndProcedure

&AtClient
Procedure UncheckAll(Command)
	ChangeUse(False);
EndProcedure

&AtClient
Procedure ChangeUse(Value)
	For Each Row In ThisObject.Sales Do
		Row.Use = Value;
	EndDo;
EndProcedure
